app/controllers/api/exercises_controller.rb

SELECT "exercises".* FROM "exercises"
---
  def index
    @exercises = Exercise.all

INSERT INTO "exercises" ("map", "name", "exercise_type", "location", "distance", "start_lnt", "start_lat", "end_lnt", "end_lat", "duration", "user_id", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    exercise_params[:start_lnt] = exercise_params[:start_lnt].to_f
    exercise_params[:start_lat] = exercise_params[:start_lat].to_f
    exercise_params[:end_lnt] = exercise_params[:end_lnt].to_f
    exercise_params[:end_lat] = exercise_params[:end_lat].to_f
    exercise_params[:duration] = exercise_params[:duration].to_i
    exercise_params[:user_id] = exercise_params[:user_id].to_i


    @exercise = Exercise.new(exercise_params)
    if @exercise.save

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @exercise = Exercise.find(params[:id])

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @exercise = Exercise.find(params[:id])

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "exercises" WHERE "exercises"."id" = $1  [["id", 1]]
---
  def destroy
    @exercise = Exercise.find(params[:id])
    @exercise.destroy